Term4/matlog/lectures/6.tex
% Created 2022-06-11 Sat 01:27
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{fancyhdr}
\usepackage{lastpage}
\usepackage{titling}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{svg}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
\input{~/.emacs.d/preamble.sty}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 6}
\hypersetup{
	pdfauthor={Ilya Yaroshevskiy},
	pdftitle={Лекция 6},
	pdfkeywords={},
	pdfsubject={},
	pdfcreator={Emacs 28.1 (Org mode 9.5.3)},
	pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Исчисление предикатов}
\label{sec:orgb0f2e37}
\subsection{Расставление скобок}
\label{sec:org4939c0b}
Кванторы имеют наименьший приоритет
\begin{examp}
	\[ \forall x. A \& B \& \forll y. C \& D \vee \exists z. E \]
	\[ (\forall x. (A \& B \& \forall y. (C \& D \vee \exists z. (E)))) \]
\end{examp}
Еще раз про правила только со скобками
\begin{enumerate}
	\item \[ \frac{\varphi \to \psi}{(\exists. \varphi) \to \psi} \]
	\item \[ \frac{\psi \to \varphi}{\psi \to (\forall x. \varphi)} \]
\end{enumerate}
\begin{examp}
	\[ \frac{\varphi \to \psi}{\exists x.(\varphi \to \psi)} \]
	--- можно доказать, но это не правило вывода для \(\exists\)
\end{examp}
\begin{definition}
	\-
	\(\alpha_1, \dots, \alpha_n\) --- доказательство
	\begin{itemize}
		\item если \(\alpha_i\) --- аксимома
		\item либо существует \(j, k < i\), что \(\alpha_k = \alpha_j \to \alpha_i\)
		\item либо существует \(\alpha_j:\ \alpha_j = \varphi \to \psi\) и \(\alpha_i = (\exists x. \varphi) \to \psi\) причем \(x\) не входит свободно в \(\psi\)
		\item либо существует \(j: \alpha_j = \psi \to \varphi\) и \(\alpha_i = \psi \to \forall x. \varphi\) причем \(x\) не входит свободно в \(\psi\)
	\end{itemize}
\end{definition}
\subsection{Вхождение}
\label{sec:orgfec75ff}
\begin{examp}
	\[ (P(\underset{1}{x}) \vee Q(\underset{2}{x})) \to (R(\underset{3}{x}) \& (\underbrace{\forall \underset{4}{x}. P_1(\underset{5}{x})}_{\text{область }\forall\text{ по }x})) \]
	1, 2, 3 --- свободные, 5 --- связанное, по пермененной 4
\end{examp}
\begin{examp}
	\[ \underbrace{\forall x. \forall y. \forall x. \forall y. \forall x. P(x)}_{\text{область }\forall\text{ по }x} \]
	Здесь \(x\) в \(P(x)\) связано. \(x\) не входит свободно в эту формулу, потому что нет свободных вхождений
\end{examp}
\begin{definition}
	Переменная \(x\) входит свободно если существует свободное вхождение
\end{definition}
\begin{definition}
	Вхождение свободно, если не связано
\end{definition}
Можно относится к свободно входящим перменным как с перменным из библиотеки, т.е. мы не имеем права их переименовывать
\begin{examp}
	Некорректная формула
	\begin{description}
		\item[{\(\alpha_1\)}] \(x = 0 \to x = 0\)
		\item[{\(\alpha_2\)}] \color{red}\((\exists x. x = 0) \to (x = 0)\) --- не доказано\color{black}
		\item[{\(\alpha_2'\)}] \((\exists t. x = 0) \to (x = 0)\) --- (правило \(\exists\))
	\end{description}
\end{examp}
\begin{examp}
	\-
	\begin{description}
		\item[{\((n)\)}] \(x = 0 \to y = 0\) --- откуда то
		\item[{\((n + 1)\)}] \((\exists x. x = 0) \to (y = 0)\) --- (правило \(\exists\))
	\end{description}
\end{examp}
\subsection{Свободные подстановки}
\label{sec:org82c329d}
\begin{definition}
	\(\Theta\) свободен для подстановки вместо \(x\) в \(\varphi\), если никакая свободная перменная в \(\Theta\) не станет связанной в \(\varphi[x := \Theta]\)
\end{definition}
\begin{definition}
	\(\varphi[x := \Theta]\) --- "Заменить все свободные вхождения x в \(\varphi\) на \(\Theta\)"
\end{definition}
\begin{examp}
	\[ (\forall x. \forall y. \forall x. P(x))[x := y] \equiv \forall x. \forall y. \forall x. P(x) \]
\end{examp}
\begin{examp}
	\[ (P(x) \vee \forall x. P(x))[x := y] \equiv P(y) \vee \forall x. P(x) \]
\end{examp}
\begin{examp}
	\[ (\forall y. x = y)\ [x := \underbrace{y}_{\equiv \Theta}] \equiv \forall y. \underset{1}{y} = y\]
	\(FV(\Theta) = \{y\}\) --- свободные перменные в \(\Theta\). Вхождение \(y\) с номером 1 стало связанным
\end{examp}
\begin{examp}
	\[ P(x) \& \forall y. x = y\ [x := y + z] \equiv P(y + z) \& \forall y. \underset{1}{y} + z = y \]
	Здесь при подстановке вхождение \(y\) с номером 1 cтало связанным. \(x\) --- библиотечная функция, переименовали \(x\) во что-то другое.
\end{examp}
\subsection{Пример доказательства}
\label{sec:org947d7c2}
\begin{lemma}
	Пусть \(\vdash \alpha\). Тогда \(\vdash \forall x. \alpha\)
\end{lemma}
\begin{proof}
	\-
	\begin{enumerate}
		\item Т.к. \(\vdash \alpha\), то существует \(\gamma_1, \dots, \gamma_2: \gamma_n = \alpha\)
		      \[ \begin{matrix}
				      (1)     & \gamma_1                               &                                  \\
				      \vdots  & \vdots                                 &                                  \\
				      (n)     & \gamma_n (\equiv \alpha)               &                                  \\
				      (n + 1) & A\& A \to A                            & \text{(акс)}                     \\
				      (n + 2) & \alpha \to ((A \& A \to A) \to \alpha) & \text{(акс)}                     \\
				      (n + 3) & (A \& A \to A) \to \alpha              & (\text{M.P } n, n + 2)           \\
				      (n + 4) & (A \& A \to A) \to \forall x.\alpha    & (\text{введение }\forall\ n + 3) \\
				      (n + 5) & \forall x. \alpha                      & (\text{M.P. } n + 1, n + 4)
			      \end{matrix} \]
	\end{enumerate}
\end{proof}
\subsection{Теорема о дедукции}
\label{sec:org33235bd}
\begin{theorem}
	Пусть задана \(\Gamma,\ \alpha,\beta\)
	\begin{enumerate}
		\item Если \(\Gamma, \alpha \vdash \beta\), то \(\Gamma \vdash \alpha \to \beta\), при условии, если в доказательстве \(\Gamma, \alpha \vdash \beta\) не применялись правила для \(\forall, \exists\) по перменным, входяшим свободно в \(\alpha\)
		\item Если \(\Gamma \vdash \alpha \to \beta\), то \(\Gamma, \alpha \vdash \beta\)
	\end{enumerate}
	\label{orgdac7f7f}
\end{theorem}
\end{document}
